---
kind: method
id: M:Autodesk.Revit.DB.ModelCurveArray.Insert(Autodesk.Revit.DB.ModelCurve,System.Int32)
source: html/db502e74-1ef3-3a9c-d6b3-32893a9bbef0.htm
---
# Autodesk.Revit.DB.ModelCurveArray.Insert Method

Insert the specified model curve into the array.

## Syntax (C#)
```csharp
public virtual void Insert(
	ModelCurve item,
	int index
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.ModelCurve`) - The model curve to be inserted into the array.
- **index** (`System.Int32`) - The model curve will be inserted before this index.

## Returns
Returns whether the model curve was inserted into the array.